---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.SplitOverlappingFacesFailed
source: html/d8768ea5-e9a1-4a1b-086a-e1f370a30cfe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.SplitOverlappingFacesFailed Property

Failed to resolve all overlaps between faces of the same Mass Energy Analytical Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId SplitOverlappingFacesFailed { get; }
```